import { Injectable } from '@angular/core';
import { Question } from '../models/question';

@Injectable({
  providedIn: 'root'
})
export class QuestionService {

  questions: Question[] = [
    new Question(1, 'Как заканчивается присказка: \'Мы и сами с...\'', new Array<string>(...['с волосами', 'с усами', 'с часами', 'с долгами']), 1),
    new Question(2, 'Как в обиходе называют растение, которое часто дарят женщинам к празднику 8 марта?', new Array<string>(...['оливье', 'винегрет', 'мимоза', 'селёдка под шубой']), 2),
    new Question(3, 'С помощью чего пассажиры часто попадают в самолёт?', new Array<string>(...['рукава', 'воротника', 'лацкана', 'манжеты']), 0),
    new Question(4, 'Как называлась песня, которую исполнял Лев Лещенко?', new Array<string>(...['\"Воробьиная стая\"', '\"Соловьиная роща\"', '\"Ласточкино гнездо\"', '\"Воронья слободка\"']), 1),
    new Question(5, 'Какой клетки нет на шахматной доске?', new Array<string>(...['h8', 'b7', 'k6', 'g5']), 2),
    new Question(6, 'На каком курсе школы Хогвартс учился Гарри Поттер, когда раскрыл секрет Тайной комнаты?', new Array<string>(...['на первом', 'на втором', 'на третьем', 'на четвёртом']), 1),
    new Question(7, 'Какой обряд перед свадьбой назывался рукобитьем?', new Array<string>(...['выяснение, кто сильнее', 'праздник друзей жениха', 'одевание невесты', 'скрепление договора']), 3),
    new Question(8, 'Кто автор строк "Ленин - жил, Ленин - жив, Ленин - будет жить"?', new Array<string>(...['Есенин', 'Маяковский', 'Сталин', 'Ленин']), 1),
    new Question(9, 'С кем воевал заглавный герой "Слова о полку Игореве"?', new Array<string>(...['с половцами', 'с сарматами', 'со скифами', 'с печенегами']), 0),
    new Question(10, 'Кого можно увидеть на картине Левитана "Март"?', new Array<string>(...['собаку', 'корову', 'лошадь', 'кошку']), 2),
    new Question(11, 'Какой московский магазин некогда носил название Верхние торговые ряды?', new Array<string>(...['ЦУМ', 'Петровский пассаж', 'Гостинный двор', 'ГУМ']), 3),
    new Question(12, 'День рождение какого персонажа в Риге отмечают на улице Яуниела?', new Array<string>(...['Джона Сильвера', 'Шерлока Холмса', 'Глеба Жиглова', 'графа Дракула']), 1),
    new Question(13, 'Какая буква исчезла из русского алфавита в результате реформы Петра I?', new Array<string>(...['\"фита\"', '\"ять\"', '\"омега\"', '\"и\" десятеричное']), 2)
  ];

  constructor() { }

  getQuestion(id: number): Question {
    return this.questions.find(q => q.id === id);
  }

  getQuestions () {
    return this.questions;
  }

  checkQuestion(questionId: number, answerId: number): boolean {
    return this.questions[questionId].hintId === answerId;
  }
}
